import pdf from '@/plugins/pdfmake-style'
import image from '@/store/image.json'

function exportSb3(){
    const info = {
        image : image.logo,
    }

    const docDefination = {
        pageMargins : [70,60,70,30],
        content : [
            {
                text : 'คำขอต่ออายุใบอนุญาตให้ตั้งสถานบริการ',
                bold : true,
                alignment : 'center',
                margin : [0,50,0,0]
            },
            {
                text : 'แบบ สบ.3',
                bold : true,
                alignment : 'right',
                relativePosition : { x : 0 , y : -45}
            },
            {
                text : `เขียนที่${'.'.repeat(45)}`,
                alignment : 'right',
                margin : [0,20,0,0]
            },
            {
                text : `วันที่ ${'.'.repeat(10)} เดือน ${'.'.repeat(22)} พ.ศ. ${'.'.repeat(10)}`,
                alignment : 'right',
            },
            {
                text : `1. ข้าพเจ้า ${' '.repeat(5)} (กรณีบุคคลธรรมดา) ${'.'.repeat(49)} สัญชาติ ${'.'.repeat(14)} อายุ ${'.'.repeat(10)} ปี`,
                margin : [35,0,0,0]
            },
            {
                canvas: [
                    {
                        type: 'rect',
                        x: 0,
                        y: 0,
                        w: 10,
                        h: 10,
                    }
                ],
                margin: [30,0,0,0],
                relativePosition: { x: 55 , y : -17}
            },
            {
                text : `เลขประจำตัวประชาชน${'.'.repeat(51)}หรือใบสำคัญประจำตัวคนต่างด้าว เลขที่${'.'.repeat(22)} `
            },
            {
                text : `ออกให้ ณ ${'.'.repeat(25)} อำเภอ/เขต ${'.'.repeat(22)} จังหวัด ${'.'.repeat(31)} อยู่บ้านเลขที่ ${'.'.repeat(22)}`
            },
            {
                text : `ตรอก/ซอย ถนน ตำบล/แขวง อำเภอ/เขต`
            },
            {
                text: `จังหวัด เลขหมายโทรศัพท์พื้นฐาน เลขหมายโทรศัพท์เคลื่อนที่`
            },
            {
                text : `${'.'.repeat(30)}`
            },
            {
                text : `(กรณีนิติบุคคล) จดทะเบียนเป็นนิติบุคคล`
            },
            {
                text : `ทะเบียนเลขที่ เมื่อวันที่ ณ สำนักงานแห่งใหญ่ตั้งอยู่เลขที่`
            },
            {
                text : `ตรอก/ซอย ถนน ตำบล/แขวง อำเภอ/เขต`
            },
            {
                text : `จังหวัด โดย ผู้แทนของนิติบุคคลผู้รับอนุญาต`
            },
            {
                text : `สัญชาติ อายุ ปี เลขประจำตัวประชาชน หรือ`
            },
            {
                text : `ใบสำคัญประจำตัวคนต่างด้าวเลขที่ ออกให้ ณ อำเภอ/เขต`
            },
            {
                text : `จังหวัด อยู่บ้านเลขที่ ตรอก/ซอย ถนน`
            },
            {
                text : `อำเภอ/เขต จังหวัด เลขหมายโทรศัพท์`
            },
            {
                text : `เลขหมายโทรศัพท์เคลื่อนที่`
            },
            {
                text : `2. ข้าพเจ้าได้รับอนุญาตให้ตั้งสถานบริการ ตามมาตรา 3(1) (2) (3) (4) (5) (6)`
            },
            {
                text : `ประจำปีพุทธศักราช ตามใบอนุญาตเลขที่`
            },
            {
                text : `โดยใช้ชื่อสถานบริการเป็นภาษาไทยว่า`
            },
            {
                text : `ภาษาต่างประเทศ(ถ้ามี) ว่า`
            },
            {
                text : `ตั้งอยู่ ณ เลขที่ ตรอก/ซอย ถนน ตำบล/แขวง`
            },
            {
                text : `อำเภอ/เขต จังหวัด เลขหมายโทรศัพท์พื้นฐาน`
            },
            {
                text : `3. ข้าพเจ้าขอยื่นคำขอต่อ ซึ่งเป็นพนักงาน`
            },
            {
                text : `เจ้าหน้าที่ตามพระราชบัญญัติสถานบริการ พ.ศ.2509 เพื่อขอต่ออายุใบอนุญาตให้ตั้งสถานบริการประจำปี`
            },
            {
                text : `พุทธศักราช`
            },

        ],
        defaultStyle : pdf.SecondaryStyle(),
    }

    docDefination.content.push(
        {
            text : `แบบ สบ.3`,
            pageBreak: 'before',
        },
        {
            text : `พร้อมกับคำขอนี้ ข้าพเจ้าได้แนบหลักฐานต่างๆ มาด้วยแล้ว คือ`,
        },
        {
            text : `เลขหมายโทรศัพท์เคลื่อนที่`
        },
        {
            text : `(1) สำเนาใบอนุญาตให้ตั้งสถานบริการ ประจำปีพุทธศักราช`
        },
        {
            text : `(2) รูปถ่ายของผู้รับอนุญาตตั้งสถานบริการหรือผู้แทนของนิติบุคคลผู้รับอนุญาตตั้งสถานบริการ`
        },
        {
            text : `หน้าตรงขนาด 4x6 เซนติเมตร จำนวนสามรูป`
        },
        {
            text : `(3) ใบรับรองแพทย์แผนปัจจุบัน ชั้น 1 รับรองว่าผู้ขอต่อใบอนุญาต หรือผู้แทนนิติบุคคล`
        },
        {
            text : `มีคุณสมบัติ ตามมาตรา 6(3) และ (4)`
        },
        {
            text : `(4) กรณีที่หลักฐานและเอกสารที่ยื่นไว้ในการขออนุญาตมีการแก้ไขหรือเปลี่ยนแปลง ผู้ขอต่ออายุ`
        },
        {
            text : `ใบอนุญาต ต้องยื่นหลักฐานและเอกสารที่มีการแก้ไขหรือเปลี่ยนแปลงด้วย`
        },
        {
            text : `(ลายมือชื่อ) ผู้ขออนุญาต`
        },
        {
            text : `()`
        },
    )

    window.pdfMake.createPdf(docDefination).open()
}

export default {
    exportSb3
}