import pdf from '@/plugins/pdfmake-style'
import image from '@/store/image.json'

function exportSb3(){
    const info = {
        image: image.logo,
        // checkbox: image.checkbox,
    }

    const docDefination = {
        pageMargins: [80, 60, 80, 60],
        content: [
            {
                image: info.image,
                alignment: 'center',
                fit: [75,75],
            },
            {
                text: `ใบอนุญาต`,
                bold: true,
                alignment: 'center',
                fontSize: 16,
                margin: [0,10,0,0]
            },
            {
                text: `ให้ตั้งสถานบริการ`,
                bold: true,
                fontSize: 16,
                alignment: 'center',
            },
            {
                text: `ประจำปี พุทธศักราช${'.'.repeat(25)}`,
                bold: true,
                fontSize: 16,
                alignment: 'center',
            },
            {
                text: `เลขที่${'.'.repeat(17)}/ ${'.'.repeat(17)}`,
                margin: [30,0,0,0]
            },
            {
                text: `อาศัยอำนาจตามความในมาตรา 4 แห่งพระราชบัญญัติสถานบริการ พ.ศ.2509 อนุญาตให้`,
                margin: [30,0,0,0]
            },
            {
                text: `(กรณีบุคคลธรรมดา) ${'.'.repeat(60)} สัญชาติ ${'.'.repeat(30)}`,
                margin: [50,0,0,0]
            },
            {
                text: `อายุ ${'.'.repeat(25)} เลขประจำตัวประชาชน ${'.'.repeat(80)} อยู่บ้านเลขที่ ${'.'.repeat(30)}`,
            },
            {
                text: `ตรอก/ซอย ${'.'.repeat(46)} ถนน ${'.'.repeat(46)} ตำบล/แขวง ${'.'.repeat(48)}`
            },
            {
                text: `อำเภอ/เขต ${'.'.repeat(45)} จังหวัด ${'.'.repeat(55)}`
            },
            {
                text: `(กรณีนิติบุคคล) ${'.'.repeat(143)}`,
                margin: [50,0,0,0]
            },
            {
                text: `จดทะเบียนเป็นนิติบุคคลทะเบียนเลขที่ ${'.'.repeat(58)} เมื่อวันที่ ${'.'.repeat(7)} เดือน ${'.'.repeat(15)} พ.ศ. ${'.'.repeat(10)}`
            },
            {
                text: `ณ ${'.'.repeat(70)} สำนักงานแห่งใหญ่ตั้งอยู่เลขที่ ${'.'.repeat(20)} ตรอก/ซอย ${'.'.repeat(25)}`
            },
            {
                text: `ถนน ${'.'.repeat(29)} ตำบล/แขวง ${'.'.repeat(32)} อำเภอ/เขต ${'.'.repeat(32)} จังหวัด ${'.'.repeat(32)}`
            },
            {
                text: `โดย ${'.'.repeat(55)} ผู้แทนของนิติบุคคลผู้รับอนุญาต สัญชาติ ${'.'.repeat(30)} อายุ ${'.'.repeat(18)} ปี`
            },
            {
                text: `ตั้งสถานบริการตามมาตรา 3(1) ${' '.repeat(3)} (2) ${' '.repeat(3)} (3) ${' '.repeat(3)} (4) ${' '.repeat(3)} (5) ${' '.repeat(3)} (6) `
            },
            {
                text: `โดยใช้ชื่อสถานบริการเป็นภาษาไทยชื่อว่า ${'.'.repeat(124)}`
            },
            {
                text: `ภาษาต่างประเทศ (ถ้ามี) ว่า ${'.'.repeat(145)}`
            },
            {
                text: `ตั้งอยู่ ณ เลขที่ ${'.'.repeat(45)} ตรอก/ซอย ${'.'.repeat(45)} ถนน ${'.'.repeat(45)}`
            },
            {
                text: `ตำบล/แขวง ${'.'.repeat(45)} อำเภอ/เขต ${'.'.repeat(45)} จังหวัด ${'.'.repeat(45)}`
            },
            {
                text: `ในเขตอันมีปริมณฑลจำกัดเพื่อการอนุญาตให้ตั้งสถานบริการ`,
                margin: [30,0,0,0]
            },
            {
                text: `นอกเขตอันมีปริมณฑลจำกัดเพื่อการอนุญาตให้ตั้งสถานบริการ`,
                margin: [30,0,0,0]
            },
            {
                text: `โดยมีปริมาณพื้นที่ที่ได้รับอนุญาตให้ตั้งสถานบริการรวมทั้งสิ้น ${'.'.repeat(25)} ตารางเมตร / ${'.'.repeat(23)} ห้อง`,
                margin: [30,0,0,0]
            },
            {
                text: `${'.'.repeat(15)} เตียง ทั้งนี้ให้เปิดทำการได้ระหว่างเวลา ${'.'.repeat(45)} นาฬิกา`
            },
            {
                text: `อนุญาต ณ วันที่ ${'.'.repeat(15)} เดือน ${'.'.repeat(25)} พ.ศ. ${'.'.repeat(15)}`,
                margin: [80,10,0,0]
            },
            {
                text: `(ลายมือชื่อ) ${'.'.repeat(50)} พนักงานเจ้าหน้าที่`,
                margin: [220,0,0,0]
            },
            {
                text: `(${'.'.repeat(50)})`,
                margin: [270,0,0,0]
            },
            {
                text: `ตำแหน่ง ${'.'.repeat(50)}`,
                margin: [240,0,0,0]
            },
            {
                text: [
                    {
                        text: `หมายเหตุ`,
                        bold: true,
                        decoration: 'underline',
                    },
                    {
                        text: `${' '.repeat(5)}ใบอนุญาตนี้ให้ใช้ได้ถึงวันที่ 31 ธันวา ของปีที่ออกใบอนุญาต`,
                        bold: true,
                    }
                ],
                margin: [0,50,0,0]
            }
        ],
        defaultStyle: pdf.SecondaryStyle(),
    }

    docDefination.content.push(
        {
            text: `เงื่อนไขในการดำเนินกิจการสถานบริการของผู้รับอนุญาตตั้งสถานบริการ`,
            bold: true,
            fontSize: 16,
            decoration: 'underline',
            alignment: 'center',
            pageBreak: 'before',
        },
        {
            text: `๑. กรณีผู้รับอนุญาตตั้งสถานบริการขาดคุณสมบัติตามมาตรา ๖ จะถูกเพิกถอนใบอนุญาตให้ตั้งสถานบริการทันที`,
            fontSize: 16,
            margin: [0,15,0,0]
        },
        {
            text: [
                {
                    text: `๒. ผู้รับอนุญาตตั้งสถานบริการจะต้องไม่กระทำการฝ่าฝืนข้อห้ามตามพระราชบัญญัติสถานบริการ พ.ศ.๒๕๐๙`
                },
                {
                    text: `และจะต้องปฏิบัติตามเงื่อนไขแห่งพระราชบัญญัติดังกล่าวรวมทั้งกฎกระทรวงและประกาศกระทรวง`
                },
                {
                    text: `ที่เกี่ยวข้องโดยเคร่งครัด`
                }
            ],
            fontSize: 16, 
        },
        {
            text: `๓. ผู้รับอนุญาตตั้งสถานบริการจะต้องไม่ดำเนินกิจการในลักษณะที่เป็นการขัดต่อความสงบเรียบร้อย หรือศีลธรรมอันดีของประชาชน`,
            fontSize: 16,
        },
        {
            text: `๔. กรณีผู้รับอนุญาตตั้งสถานบริการละเลยหรือกระทำการฝ่าฝืนเงื่อนไขดังกล่าวข้างต้นจะต้องถูกดำเนินคดีอาญาตามที่กฎหมายบัญญัติและพนักงานเจ้าหน้าที่มีอำนาจสั่งพักใช้ใบอนุญาต หรือสั่งเพิกถอนใบอนุญาตแล้วแต่กรณีได้ทันที หรือพนักงานเจ้าหน้าที่อาจมีคำสั่งไม่ต่ออายุใบอนุญาตให้ตั้งสถานบริการในปีถัดไปทั้งนี้ตามหลักเกณฑ์ที่กระทรวงมหาดไทยได้ออกประกาศไว้`,
            fontSize: 16,
        },
        {
            text: `๕. ใบอนุญาตให้ตั้งสถานบริการให้ใช้ได้จนถึง ๓๑ ธันวาคม ของปีที่ระบุในใบอนุญาต ผู้รับอนุญาตผู้ใดประสงค์จะขอต่ออายุใบอนุญาต จะต้องยื่นคำขอเสียก่อนใบอนุญาตสิ้นอายุ`,
            fontSize: 16,
        }
    )
    //pdf.pdfPrintPreview(docDefination)
    window.pdfMake.createPdf(docDefination).open()
}

export default {
    exportSb3
}