import pdf from '@/plugins/pdfmake-style'
import image from '@/store/image.json'

function exportSb5(){
    const info = {
        image : image.logo
    }

    const docDefination = {
        pageMargins : [80,70,60,30],
        content : [
            {
                text : `แบบ สบ.5`
            },
            {
                text : `ชื่อสถานบริการ`
            },
            {
                text : `ใบอนุญาตเลขที่`
            },
            {
                text : `วันที่ เดือน พ.ศ.`
            },
            {
                text : `เรื่อง แจ้งการเปลี่ยนแปลงรายการในบัตรประวัติของพนักงานสถานบริการ`
            },
            {
                text : `เรียน นายอำเภอ/ปลัดอำเภอผู้เป็นหัวหน้าประจำกึ่งอำเภอ`
            },
            {
                text : `(กรณีในจังหวัดอื่นนอกจากกรุงเทพมหานคร)`
            },
            {
                text : `ผู้กำกับการ/รองผู้กำกับการซึ่งเป็นหัวหน้าสถานีตำรวจนครบาล`
            },
            {
                text : `(กรณีในกรุงเทพมหานคร)`
            },
            {
                text : `เพื่อให้เป็นไปตามมาตรา 14 แห่งพระราชบัญญัติสถานบริการ พ.ศ. 2509 แก้ไขเพิ่มเติม`
            },
            {
                text : `โดยพระราชบัญญัติสถานบริการ (ฉบับที่ 4) พ.ศ. 2546 และกฎกระทรวงกำหนดหลักเกณฑ์เกี่ยวกับการ`
            },
            {
                text : `ขออนุญาตและการดำเนินกิจการสถานบริการ พ.ศ. 2549 ออกตามความในพระราชบัญญัติสถานบริการ`
            },
            {
                text : `พ.ศ.2509 ข้าพเจ้า จึงขอแจ้งว่าบัตรประวัติของ หมายเลขประจำตัว`
            },
            {
                text : `ของพนักงานสถานบริการ เลขที่ ซึ่งทำงานในหน้าที่ ในสถานบริการ`
            },
            {
                text : `ของข้าพเจ้าได้มีการเปลี่ยนแปลงรายการดังนี้`
            },
            {
                text : `${'.'.replace(100)}`
            },
            {
                text : `${'.'.replace(100)}`
            },
            {
                text : `${'.'.replace(100)}`
            },
            {
                text : `${'.'.replace(100)}`
            },
            {
                text : `จึงเรียนมาเพื่อทราบ พร้อมนี้ได้แนบหลักฐานการเปลี่ยนแปลงมาด้วยแล้ว`
            },
            {
                text : `ขอแสดงความนับถือ`
            },
            {
                text : `(ลายมือชื่อ) ผู้รับอนุญาตตั้งสถานบริการ`
            },
            {
                text : `()`
            },
            {
                text : `(ลายมือชื่อ) เจ้าของประวัติ`
            },
            {
                text : `()`
            },
        ],
        defaultStyle : pdf.SecondaryStyle(),
    }

    docDefination.content.push(
        {
            text : `(ด้านหลัง)`,
            pageBreak: 'before',
        },
        {
            text : `แบบ สบ.5`
        },
        {
            table : {
                widths : ['*','*'],
                body : [
                    [
                        [
                            {
                                text : `ประวัติย่อ`
                            },
                            {
                                text : `ชื่อ`
                            },
                            {
                                text : `เลขประจำตัวประชาชน`
                            },
                            {
                                text : `ชื่อบิดา`
                            },
                            {
                                text : `ชื่อมารดา`
                            },
                            {
                                text : `วันเกิดที่ เดือน พ.ศ.`
                            },
                            {
                                text : `อำเภอ/เขต`
                            },
                            {
                                text : `จังหวัด`
                            },
                        ], 
                        [
                            {
                                text : `บัตรประจำตัวประชาชนหรือใบคำสัญ`
                            },
                            {
                                text : `ประจำตัวคนต่างด้าว`
                            },
                            {
                                text : `เลขที่ ลงวันที่`
                            },
                            {
                                text : `ออกให้ ณ`
                            },
                            {
                                text : `อำเภอ/เขต`
                            },
                            {
                                text : `จังหวัด`
                            },
                            {
                                text : `ที่อยู่ปัจจุบัน`
                            },
                            {
                                text : `อยู่บ้านเลขที่`
                            },
                            {
                                text : `ตรอก/ซอย`
                            },
                            {
                                text : `ถนน`
                            },
                            {
                                text : `ตำบล/แขวง`
                            },
                            {
                                text : `อำเภอ/เขต`
                            },
                            {
                                text : `จังหวัด`
                            },
                            {
                                text : `เลขหมายโทรศัพท์พืื้นฐาน`
                            },
                            {
                                text : `เลขหมายโทรศัพท์เคลื่อนที่ของพนักงาน`
                            },
                        ]
                    ]
                ]
            }
        },
        {
            text : `ผลการตรวจสอบของเจ้าหน้าที่`
        },
        {
            text : `${'.'.repeat(100)}`
        },
        {
            text : `${'.'.repeat(100)}`
        },
        {
            text : `${'.'.repeat(100)}`
        },
        {
            text : `${'.'.repeat(100)}`
        },
        {
            text : `คำสั่งของนายอำเภอหรือปลัดอำเภอผู้เป็นหัวหน้าประจำกึ่งอำเภอท้องที่`
        },
        {
            text : `กรณีในจังหวัดอื่นนอกจากกรุงเทพมหานคร หรือผู้กำกับการหรือรองผู้กำกับ`
        },
        {
            text : `ซึ่งเป็นหัวหน้าสถานีตำรวจนครบาลท้องที่กรณีในกรุงเทพมหานคร`
        },
        {
            text : `ทราบ/ให้เก็บรักษาไว้คู่กับประวัติเดิม`
        },
        {
            text : `อื่นๆ`
        },
        {
            text : `(ลายมือชื่อ)`
        },
        {
            text : `()`
        },
        {
            text : `ตำแหน่ง`
        },
    )

    window.pdfMake.createPdf(docDefination).open()
}

export default {
    exportSb5
}